<a href="https://colab.research.google.com/github/puzlike/expert-octo-telegram/blob/main/dataframe.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [21]:
import pandas as pd

data = {
'Name': ['Ema', 'Riku', 'Haruki', 'Mei', 'Sana', 'Yuito', 'Ichika', 'Souta'],
'Age': [25, 30, 33, 29, 31, 24, 21, 27],
'City': ['Tokyo', 'Osaka', 'Fukuoka', 'Sapporo', 'Nagoya', 'Fukuoka', 'Osaka', 'Tokyo'],
'Salary': [50000, 70000, 60000, 80000, 55000, 48000, 73000, 65000],
'Department': ['Sales', 'Marketing', 'Sales', 'HR', 'Finance', 'HR', 'Sales', 'Marketing']
}

df = pd.DataFrame(data)
df1 = df.query('Department == "Sales" & Age >= 25')
print(df1)
print()
df2 = df.sort_values('Age').reset_index()
print(df2)
print()
df3 = df[['Salary', 'Department']].groupby('Department').mean('Salary').astype('int')
print(df3)
print()
df['Bonus'] = df['Salary'] * 0.1
df['Bonus'] = df['Bonus'].astype('int')
print(df)

     Name  Age     City  Salary Department
0     Ema   25    Tokyo   50000      Sales
2  Haruki   33  Fukuoka   60000      Sales

   index    Name  Age     City  Salary Department
0      6  Ichika   21    Osaka   73000      Sales
1      5   Yuito   24  Fukuoka   48000         HR
2      0     Ema   25    Tokyo   50000      Sales
3      7   Souta   27    Tokyo   65000  Marketing
4      3     Mei   29  Sapporo   80000         HR
5      1    Riku   30    Osaka   70000  Marketing
6      4    Sana   31   Nagoya   55000    Finance
7      2  Haruki   33  Fukuoka   60000      Sales

            Salary
Department
Finance      55000
HR           64000
Marketing    67500
Sales        61000

     Name  Age     City  Salary Department  Bonus
0     Ema   25    Tokyo   50000      Sales   5000
1    Riku   30    Osaka   70000  Marketing   7000
2  Haruki   33  Fukuoka   60000      Sales   6000
3     Mei   29  Sapporo   80000         HR   8000
4    Sana   31   Nagoya   55000    Finance   5500
5   Yuito   24  Fukuoka   48000         HR   4800
6  Ichika   21    Osaka   73000      Sales   7300
7   Souta   27    Tokyo   65000  Marketing   6500